Revit 2026 API

# MultistoryStairsDisconnectLevels Method

---
**Namespace:** Autodesk.Revit.DB.Architecture**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void DisconnectLevels(
	ISet<ElementId> levelIds
)
```
```vb
Public Sub DisconnectLevels (
	levelIds As ISet(Of ElementId)
)
```
```cpp
public:
void DisconnectLevels(
	ISet<ElementId^>^ levelIds
)
```
```fsharp
member DisconnectLevels :
        levelIds : ISet<ElementId> -> unit
```

#### Parameters

levelIds ISetElementId

#### Reference

MultistoryStairs Class

Autodesk.Revit.DB.Architecture Namespace